/**
NODE.JS script to generate the data.js file needed by qtag 

*/
var fs = require('fs');

//fs.writeFileSync('data0.js', "", 'utf8')


var file = fs.readFileSync('quran-simple-clean.txt', 'utf8');
var raw = file.split('\n');


var en = fs.readFileSync('en.qaribullah.txt', 'utf8');
en = en.replaceAll('"', '\'');
var raw_en = en.split('\n');

//var data = [];
//for(var i=0; i < 6237; i++){
//	console.log(raw[i]);
//	var subraw = raw[i].split('|');
//	var subdata = {};
//	subdata.sura = subraw[0];
//	subdata.aya = subraw[1];
//	subdata.text = subraw[2];
//	data.push(subdata);
//}
//console.log(data);

var output = '';
output += 'var allFilters = [];';
output += '\n';
output += 'var surat = ["", "الفاتحة", "البقرة", "آل عمران", "النساء", "المآئدة", "الأنعام", "الأعراف", "الأنفال", "التوبة", "يونس", "هود", "يوسف", "الرعد", "إبراهيم", "الحجر", "النحل", "الإسراء", "الكهف", "مريم", "طـه", "الأنبياء", "الحج", "المؤمنون", "النور", "الفرقان", "الشعراء", "النمل", "القصص", "العنكبوت", "الروم", "لقمان", "السجدة", "الأحزاب", "سبأ", "فاطر", "يس", "الصافات", "ص", "الزمر", "غافر", "فصلت", "الشورى", "الزخرف", "الدخان", "الجاثية", "الأحقاف", "محمد", "الفتح", "الحجرات", "ق", "الذاريات", "الطور", "النجم", "القمر", "الرحمن", "الواقعة", "الحديد", "المجادلة", "الحشر", "الممتحنة", "الصف", "الجمعة", "المنافقون", "التغابن", "الطلاق", "التحريم", "الملك", "القلم", "الحاقة", "المعارج", "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات", "النبأ", "النازعات", "عبس", "التكوير", "الإنفطار", "المطففين", "الإنشقاق", "البرج", "الطارق", "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق", "القدر", "البيِّنة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهمزة", "الفيل", "قريش", "الماعون", "الكوثر", "الكافرون", "النصر", "المسد", "الإخلاص", "الفلق", "الناس"];';
output += '\n';
output += 'var firstAyat = [1, 1, 8, 294, 494, 670, 790, 955, 1161, 1236, 1365, 1474, 1597, 1708, 1751, 1803, 1902, 2030, 2141, 2251, 2349, 2484, 2596, 2674, 2792, 2856, 2933, 3160, 3253, 3341, 3410, 3470, 3504, 3534, 3607, 3661, 3706, 3789, 3971, 4059, 4134, 4219, 4273, 4326, 4415, 4474, 4511, 4546, 4584, 4613, 4631, 4676, 4736, 4785, 4847, 4902, 4980, 5076, 5105, 5127, 5151, 5164, 5178, 5189, 5200, 5218, 5230, 5242, 5272, 5324, 5376, 5420, 5448, 5476, 5496, 5552, 5592, 5623, 5673, 5713, 5759, 5801, 5830, 5849, 5885, 5910, 5932, 5949, 5968, 5994, 6024, 6044, 6059, 6080, 6091, 6099, 6107, 6126, 6131, 6139, 6147, 6158, 6169, 6177, 6180, 6189, 6194, 6198, 6205, 6208, 6214, 6217, 6222, 6226, 6231];';


output += '\n';
//output += 'var data = ' + JSON.stringify(data);
output += 'var data = [';
output += '\n';
var subraw = '';
for(var i=0; i < 6235; i++){
	console.log(raw[i]);
	subraw = raw[i].split('|');
	output+= '{sura:' + subraw[0] + ', aya:' + subraw[1] + ', text:"' + subraw[2]+'"}, \n';
}
subraw = raw[6235].split('|');
output+= '{sura:' + subraw[0] + ', aya:' + subraw[1] + ', text:"' + subraw[2]+'"} \n'; //----> last line without a comma :-/
output += '];';


output += 'var data_en = [';
output += '\n';
for(var i=0; i < 6235; i++){
	console.log(raw_en[i]);
	subraw = raw_en[i].split('|');
	output+= '{sura:' + subraw[0] + ', aya:' + subraw[1] + ', text:"' + subraw[2]+'"}, \n';
}
subraw = raw[6235].split('|');
output+= '{sura:' + subraw[0] + ', aya:' + subraw[1] + ', text:"' + subraw[2]+'"} \n'; //----> last line without a comma :-/
output += '];';


fs.writeFileSync('data0.js', output, 'utf8')